Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/cvd.h
#define CVD_CVDRX0_RXAN1_Pos                  _UINT32_(0)                                          /* (CVD_CVDRX0) ANx/CVDR channel to use for RX Index 0 Position */
#define CVD_CVDRX0_RXAN1_Msk                  (_UINT32_(0x3F) << CVD_CVDRX0_RXAN1_Pos)             /* (CVD_CVDRX0) ANx/CVDR channel to use for RX Index 0 Mask */
#define CVD_CVDRX0_RXAN1(value)               (CVD_CVDRX0_RXAN1_Msk & (_UINT32_(value) << CVD_CVDRX0_RXAN1_Pos)) /* Assignment of value for RXAN1 in the CVD_CVDRX0 register */
#define CVD_CVDRX0_RXAN2_Pos                  _UINT32_(8)                                          /* (CVD_CVDRX0) ANx/CVDR channel to use for RX Index 1 Position */
#define CVD_CVDRX0_RXAN2_Msk                  (_UINT32_(0x3F) << CVD_CVDRX0_RXAN2_Pos)             /* (CVD_CVDRX0) ANx/CVDR channel to use for RX Index 1 Mask */
#define CVD_CVDRX0_RXAN2(value)               (CVD_CVDRX0_RXAN2_Msk & (_UINT32_(value) << CVD_CVDRX0_RXAN2_Pos)) /* Assignment of value for RXAN2 in the CVD_CVDRX0 register */
#define CVD_CVDRX0_RXAN3_Pos                  _UINT32_(16)                                         /* (CVD_CVDRX0) ANx/CVDR channel to use for RX Index 2 Position */
#define CVD_CVDRX0_RXAN3_Msk                  (_UINT32_(0x3F) << CVD_CVDRX0_RXAN3_Pos)             /* (CVD_CVDRX0) ANx/CVDR channel to use for RX Index 2 Mask */
#define CVD_CVDRX0_RXAN3(value)               (CVD_CVDRX0_RXAN3_Msk & (_UINT32_(value) << CVD_CVDRX0_RXAN3_Pos)) /* Assignment of value for RXAN3 in the CVD_CVDRX0 register */
#define CVD_CVDRX0_RXAN4_Pos                  _UINT32_(24)                                         /* (CVD_CVDRX0) ANx/CVDR channel to use for RX Index 3 Position */
#define CVD_CVDRX0_RXAN4_Msk                  (_UINT32_(0x3F) << CVD_CVDRX0_RXAN4_Pos)             /* (CVD_CVDRX0) ANx/CVDR channel to use for RX Index 3 Mask */
#define CVD_CVDRX0_RXAN4(value)               (CVD_CVDRX0_RXAN4_Msk & (_UINT32_(value) << CVD_CVDRX0_RXAN4_Pos)) /* Assignment of value for RXAN4 in the CVD_CVDRX0 register */
#define CVD_CVDRX0_Msk                        _UINT32_(0x3F3F3F3F)                                 /* (CVD_CVDRX0) Register Mask  */


/* -------- CVD_CVDRX1 : (CVD Offset: 0x84) (R/W 32) CVD RECEIVE INDEX 4-7 CONFIGURATION Register -------- */
#define CVD_CVDRX1_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDRX1) CVD RECEIVE INDEX 4-7 CONFIGURATION Register  Reset Value */

#define CVD_CVDRX1_RXAN5_Pos                  _UINT32_(0)                                          /* (CVD_CVDRX1) ANx/CVDR channel to use for RX Index 4 Position */
#define CVD_CVDRX1_RXAN5_Msk                  (_UINT32_(0x3F) << CVD_CVDRX1_RXAN5_Pos)             /* (CVD_CVDRX1) ANx/CVDR channel to use for RX Index 4 Mask */
#define CVD_CVDRX1_RXAN5(value)               (CVD_CVDRX1_RXAN5_Msk & (_UINT32_(value) << CVD_CVDRX1_RXAN5_Pos)) /* Assignment of value for RXAN5 in the CVD_CVDRX1 register */
#define CVD_CVDRX1_RXAN6_Pos                  _UINT32_(8)                                          /* (CVD_CVDRX1) ANx/CVDR channel to use for RX Index 5 Position */
#define CVD_CVDRX1_RXAN6_Msk                  (_UINT32_(0x3F) << CVD_CVDRX1_RXAN6_Pos)             /* (CVD_CVDRX1) ANx/CVDR channel to use for RX Index 5 Mask */
#define CVD_CVDRX1_RXAN6(value)               (CVD_CVDRX1_RXAN6_Msk & (_UINT32_(value) << CVD_CVDRX1_RXAN6_Pos)) /* Assignment of value for RXAN6 in the CVD_CVDRX1 register */
#define CVD_CVDRX1_RXAN7_Pos                  _UINT32_(16)                                         /* (CVD_CVDRX1) ANx/CVDR channel to use for RX Index 6 Position */
#define CVD_CVDRX1_RXAN7_Msk                  (_UINT32_(0x3F) << CVD_CVDRX1_RXAN7_Pos)             /* (CVD_CVDRX1) ANx/CVDR channel to use for RX Index 6 Mask */
#define CVD_CVDRX1_RXAN7(value)               (CVD_CVDRX1_RXAN7_Msk & (_UINT32_(value) << CVD_CVDRX1_RXAN7_Pos)) /* Assignment of value for RXAN7 in the CVD_CVDRX1 register */
#define CVD_CVDRX1_RXAN8_Pos                  _UINT32_(24)                                         /* (CVD_CVDRX1) ANx/CVDR channel to use for RX Index 7 Position */
#define CVD_CVDRX1_RXAN8_Msk                  (_UINT32_(0x3F) << CVD_CVDRX1_RXAN8_Pos)             /* (CVD_CVDRX1) ANx/CVDR channel to use for RX Index 7 Mask */
#define CVD_CVDRX1_RXAN8(value)               (CVD_CVDRX1_RXAN8_Msk & (_UINT32_(value) << CVD_CVDRX1_RXAN8_Pos)) /* Assignment of value for RXAN8 in the CVD_CVDRX1 register */
#define CVD_CVDRX1_Msk                        _UINT32_(0x3F3F3F3F)                                 /* (CVD_CVDRX1) Register Mask  */


/* -------- CVD_CVDRX2 : (CVD Offset: 0x88) (R/W 32) CVD RECEIVE INDEX 8-11 CONFIGURATION Register -------- */
#define CVD_CVDRX2_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDRX2) CVD RECEIVE INDEX 8-11 CONFIGURATION Register  Reset Value */

#define CVD_CVDRX2_RXAN9_Pos                  _UINT32_(0)                                          /* (CVD_CVDRX2) ANx/CVDR channel to use for RX Index 8 Position */
#define CVD_CVDRX2_RXAN9_Msk                  (_UINT32_(0x3F) << CVD_CVDRX2_RXAN9_Pos)             /* (CVD_CVDRX2) ANx/CVDR channel to use for RX Index 8 Mask */
#define CVD_CVDRX2_RXAN9(value)               (CVD_CVDRX2_RXAN9_Msk & (_UINT32_(value) << CVD_CVDRX2_RXAN9_Pos)) /* Assignment of value for RXAN9 in the CVD_CVDRX2 register */
#define CVD_CVDRX2_RXAN10_Pos                 _UINT32_(8)                                          /* (CVD_CVDRX2) ANx/CVDR channel to use for RX Index 9 Position */
#define CVD_CVDRX2_RXAN10_Msk                 (_UINT32_(0x3F) << CVD_CVDRX2_RXAN10_Pos)            /* (CVD_CVDRX2) ANx/CVDR channel to use for RX Index 9 Mask */
#define CVD_CVDRX2_RXAN10(value)              (CVD_CVDRX2_RXAN10_Msk & (_UINT32_(value) << CVD_CVDRX2_RXAN10_Pos)) /* Assignment of value for RXAN10 in the CVD_CVDRX2 register */
#define CVD_CVDRX2_RXAN11_Pos                 _UINT32_(16)                                         /* (CVD_CVDRX2) ANx/CVDR channel to use for RX Index 10 Position */
#define CVD_CVDRX2_RXAN11_Msk                 (_UINT32_(0x3F) << CVD_CVDRX2_RXAN11_Pos)            /* (CVD_CVDRX2) ANx/CVDR channel to use for RX Index 10 Mask */
#define CVD_CVDRX2_RXAN11(value)              (CVD_CVDRX2_RXAN11_Msk & (_UINT32_(value) << CVD_CVDRX2_RXAN11_Pos)) /* Assignment of value for RXAN11 in the CVD_CVDRX2 register */
#define CVD_CVDRX2_RXAN12_Pos                 _UINT32_(24)                                         /* (CVD_CVDRX2) ANx/CVDR channel to use for RX Index 11 Position */
#define CVD_CVDRX2_RXAN12_Msk                 (_UINT32_(0x3F) << CVD_CVDRX2_RXAN12_Pos)            /* (CVD_CVDRX2) ANx/CVDR channel to use for RX Index 11 Mask */
#define CVD_CVDRX2_RXAN12(value)              (CVD_CVDRX2_RXAN12_Msk & (_UINT32_(value) << CVD_CVDRX2_RXAN12_Pos)) /* Assignment of value for RXAN12 in the CVD_CVDRX2 register */
#define CVD_CVDRX2_Msk                        _UINT32_(0x3F3F3F3F)                                 /* (CVD_CVDRX2) Register Mask  */


/* -------- CVD_CVDRX3 : (CVD Offset: 0x8C) (R/W 32) CVD RECEIVE INDEX 12-15 CONFIGURATION Register -------- */
#define CVD_CVDRX3_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDRX3) CVD RECEIVE INDEX 12-15 CONFIGURATION Register  Reset Value */

#define CVD_CVDRX3_RXAN13_Pos                 _UINT32_(0)                                          /* (CVD_CVDRX3) ANx/CVDR channel to use for RX Index 12 Position */
#define CVD_CVDRX3_RXAN13_Msk                 (_UINT32_(0x3F) << CVD_CVDRX3_RXAN13_Pos)            /* (CVD_CVDRX3) ANx/CVDR channel to use for RX Index 12 Mask */
#define CVD_CVDRX3_RXAN13(value)              (CVD_CVDRX3_RXAN13_Msk & (_UINT32_(value) << CVD_CVDRX3_RXAN13_Pos)) /* Assignment of value for RXAN13 in the CVD_CVDRX3 register */
#define CVD_CVDRX3_RXAN14_Pos                 _UINT32_(8)                                          /* (CVD_CVDRX3) ANx/CVDR channel to use for RX Index 13 Position */
#define CVD_CVDRX3_RXAN14_Msk                 (_UINT32_(0x3F) << CVD_CVDRX3_RXAN14_Pos)            /* (CVD_CVDRX3) ANx/CVDR channel to use for RX Index 13 Mask */
#define CVD_CVDRX3_RXAN14(value)              (CVD_CVDRX3_RXAN14_Msk & (_UINT32_(value) << CVD_CVDRX3_RXAN14_Pos)) /* Assignment of value for RXAN14 in the CVD_CVDRX3 register */
#define CVD_CVDRX3_RXAN15_Pos                 _UINT32_(16)                                         /* (CVD_CVDRX3) ANx/CVDR channel to use for RX Index 14 Position */
#define CVD_CVDRX3_RXAN15_Msk                 (_UINT32_(0x3F) << CVD_CVDRX3_RXAN15_Pos)            /* (CVD_CVDRX3) ANx/CVDR channel to use for RX Index 14 Mask */
#define CVD_CVDRX3_RXAN15(value)              (CVD_CVDRX3_RXAN15_Msk & (_UINT32_(value) << CVD_CVDRX3_RXAN15_Pos)) /* Assignment of value for RXAN15 in the CVD_CVDRX3 register */
#define CVD_CVDRX3_RXAN16_Pos                 _UINT32_(24)                                         /* (CVD_CVDRX3) ANx/CVDR channel to use for RX Index 15 Position */
#define CVD_CVDRX3_RXAN16_Msk                 (_UINT32_(0x3F) << CVD_CVDRX3_RXAN16_Pos)            /* (CVD_CVDRX3) ANx/CVDR channel to use for RX Index 15 Mask */
#define CVD_CVDRX3_RXAN16(value)              (CVD_CVDRX3_RXAN16_Msk & (_UINT32_(value) << CVD_CVDRX3_RXAN16_Pos)) /* Assignment of value for RXAN16 in the CVD_CVDRX3 register */
#define CVD_CVDRX3_Msk                        _UINT32_(0x3F3F3F3F)                                 /* (CVD_CVDRX3) Register Mask  */


/* -------- CVD_CVDRX4 : (CVD Offset: 0x90) (R/W 32) CVD RECEIVE INDEX 16-17 CONFIGURATION Register -------- */
#define CVD_CVDRX4_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDRX4) CVD RECEIVE INDEX 16-17 CONFIGURATION Register  Reset Value */

#define CVD_CVDRX4_RXAN17_Pos                 _UINT32_(0)                                          /* (CVD_CVDRX4) ANx/CVDR channel to use for RX Index 16 Position */
#define CVD_CVDRX4_RXAN17_Msk                 (_UINT32_(0x3F) << CVD_CVDRX4_RXAN17_Pos)            /* (CVD_CVDRX4) ANx/CVDR channel to use for RX Index 16 Mask */
#define CVD_CVDRX4_RXAN17(value)              (CVD_CVDRX4_RXAN17_Msk & (_UINT32_(value) << CVD_CVDRX4_RXAN17_Pos)) /* Assignment of value for RXAN17 in the CVD_CVDRX4 register */
#define CVD_CVDRX4_RXAN18_Pos                 _UINT32_(8)                                          /* (CVD_CVDRX4) ANx/CVDR channel to use for RX Index 17 Position */
#define CVD_CVDRX4_RXAN18_Msk                 (_UINT32_(0x3F) << CVD_CVDRX4_RXAN18_Pos)            /* (CVD_CVDRX4) ANx/CVDR channel to use for RX Index 17 Mask */
#define CVD_CVDRX4_RXAN18(value)              (CVD_CVDRX4_RXAN18_Msk & (_UINT32_(value) << CVD_CVDRX4_RXAN18_Pos)) /* Assignment of value for RXAN18 in the CVD_CVDRX4 register */
#define CVD_CVDRX4_Msk                        _UINT32_(0x00003F3F)                                 /* (CVD_CVDRX4) Register Mask  */


/* -------- CVD_CVDTX0 : (CVD Offset: 0xC0) (R/W 32) CVD TRANSMIT INDEX 0-3 NCONFIGURATION -------- */
#define CVD_CVDTX0_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDTX0) CVD TRANSMIT INDEX 0-3 NCONFIGURATION  Reset Value */

#define CVD_CVDTX0_TXAN0_Pos                  _UINT32_(0)                                          /* (CVD_CVDTX0) CVDT channel to use for TX Index 0 Position */
#define CVD_CVDTX0_TXAN0_Msk                  (_UINT32_(0x3F) << CVD_CVDTX0_TXAN0_Pos)             /* (CVD_CVDTX0) CVDT channel to use for TX Index 0 Mask */
#define CVD_CVDTX0_TXAN0(value)               (CVD_CVDTX0_TXAN0_Msk & (_UINT32_(value) << CVD_CVDTX0_TXAN0_Pos)) /* Assignment of value for TXAN0 in the CVD_CVDTX0 register */
#define CVD_CVDTX0_TXAN1_Pos                  _UINT32_(8)                                          /* (CVD_CVDTX0) CVDT channel to use for TX Index 1 Position */
#define CVD_CVDTX0_TXAN1_Msk                  (_UINT32_(0x3F) << CVD_CVDTX0_TXAN1_Pos)             /* (CVD_CVDTX0) CVDT channel to use for TX Index 1 Mask */
#define CVD_CVDTX0_TXAN1(value)               (CVD_CVDTX0_TXAN1_Msk & (_UINT32_(value) << CVD_CVDTX0_TXAN1_Pos)) /* Assignment of value for TXAN1 in the CVD_CVDTX0 register */
#define CVD_CVDTX0_TXAN2_Pos                  _UINT32_(16)                                         /* (CVD_CVDTX0) CVDT channel to use for TX Index 2 Position */
#define CVD_CVDTX0_TXAN2_Msk                  (_UINT32_(0x3F) << CVD_CVDTX0_TXAN2_Pos)             /* (CVD_CVDTX0) CVDT channel to use for TX Index 2 Mask */
#define CVD_CVDTX0_TXAN2(value)               (CVD_CVDTX0_TXAN2_Msk & (_UINT32_(value) << CVD_CVDTX0_TXAN2_Pos)) /* Assignment of value for TXAN2 in the CVD_CVDTX0 register */
#define CVD_CVDTX0_TXAN3_Pos                  _UINT32_(24)                                         /* (CVD_CVDTX0) CVDT channel to use for TX Index 3 Position */
#define CVD_CVDTX0_TXAN3_Msk                  (_UINT32_(0x3F) << CVD_CVDTX0_TXAN3_Pos)             /* (CVD_CVDTX0) CVDT channel to use for TX Index 3 Mask */
#define CVD_CVDTX0_TXAN3(value)               (CVD_CVDTX0_TXAN3_Msk & (_UINT32_(value) << CVD_CVDTX0_TXAN3_Pos)) /* Assignment of value for TXAN3 in the CVD_CVDTX0 register */
#define CVD_CVDTX0_Msk                        _UINT32_(0x3F3F3F3F)                                 /* (CVD_CVDTX0) Register Mask  */


/* -------- CVD_CVDTX1 : (CVD Offset: 0xC4) (R/W 32) CVD TRANSMIT INDEX 4-7 NCONFIGURATION -------- */
#define CVD_CVDTX1_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDTX1) CVD TRANSMIT INDEX 4-7 NCONFIGURATION  Reset Value */

#define CVD_CVDTX1_TXAN4_Pos                  _UINT32_(0)                                          /* (CVD_CVDTX1) CVDT channel to use for TX Index 4 Position */
#define CVD_CVDTX1_TXAN4_Msk                  (_UINT32_(0x3F) << CVD_CVDTX1_TXAN4_Pos)             /* (CVD_CVDTX1) CVDT channel to use for TX Index 4 Mask */
#define CVD_CVDTX1_TXAN4(value)               (CVD_CVDTX1_TXAN4_Msk & (_UINT32_(value) << CVD_CVDTX1_TXAN4_Pos)) /* Assignment of value for TXAN4 in the CVD_CVDTX1 register */
#define CVD_CVDTX1_TXAN5_Pos                  _UINT32_(8)                                          /* (CVD_CVDTX1) CVDT channel to use for TX Index 5 Position */
#define CVD_CVDTX1_TXAN5_Msk                  (_UINT32_(0x3F) << CVD_CVDTX1_TXAN5_Pos)             /* (CVD_CVDTX1) CVDT channel to use for TX Index 5 Mask */
#define CVD_CVDTX1_TXAN5(value)               (CVD_CVDTX1_TXAN5_Msk & (_UINT32_(value) << CVD_CVDTX1_TXAN5_Pos)) /* Assignment of value for TXAN5 in the CVD_CVDTX1 register */
#define CVD_CVDTX1_TXAN6_Pos                  _UINT32_(16)                                         /* (CVD_CVDTX1) CVDT channel to use for TX Index 6 Position */
#define CVD_CVDTX1_TXAN6_Msk                  (_UINT32_(0x3F) << CVD_CVDTX1_TXAN6_Pos)             /* (CVD_CVDTX1) CVDT channel to use for TX Index 6 Mask */
#define CVD_CVDTX1_TXAN6(value)               (CVD_CVDTX1_TXAN6_Msk & (_UINT32_(value) << CVD_CVDTX1_TXAN6_Pos)) /* Assignment of value for TXAN6 in the CVD_CVDTX1 register */
#define CVD_CVDTX1_TXAN7_Pos                  _UINT32_(24)                                         /* (CVD_CVDTX1) CVDT channel to use for TX Index 7 Position */
#define CVD_CVDTX1_TXAN7_Msk                  (_UINT32_(0x3F) << CVD_CVDTX1_TXAN7_Pos)             /* (CVD_CVDTX1) CVDT channel to use for TX Index 7 Mask */
#define CVD_CVDTX1_TXAN7(value)               (CVD_CVDTX1_TXAN7_Msk & (_UINT32_(value) << CVD_CVDTX1_TXAN7_Pos)) /* Assignment of value for TXAN7 in the CVD_CVDTX1 register */
#define CVD_CVDTX1_Msk                        _UINT32_(0x3F3F3F3F)                                 /* (CVD_CVDTX1) Register Mask  */


/* -------- CVD_CVDTX2 : (CVD Offset: 0xC8) (R/W 32) CVD TRANSMIT INDEX 8-11 NCONFIGURATION -------- */
#define CVD_CVDTX2_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDTX2) CVD TRANSMIT INDEX 8-11 NCONFIGURATION  Reset Value */

#define CVD_CVDTX2_TXAN8_Pos                  _UINT32_(0)                                          /* (CVD_CVDTX2) CVDT channel to use for TX Index 8 Position */
#define CVD_CVDTX2_TXAN8_Msk                  (_UINT32_(0x3F) << CVD_CVDTX2_TXAN8_Pos)             /* (CVD_CVDTX2) CVDT channel to use for TX Index 8 Mask */
#define CVD_CVDTX2_TXAN8(value)               (CVD_CVDTX2_TXAN8_Msk & (_UINT32_(value) << CVD_CVDTX2_TXAN8_Pos)) /* Assignment of value for TXAN8 in the CVD_CVDTX2 register */
#define CVD_CVDTX2_TXAN9_Pos                  _UINT32_(8)                                          /* (CVD_CVDTX2) CVDT channel to use for TX Index 9 Position */
#define CVD_CVDTX2_TXAN9_Msk                  (_UINT32_(0x3F) << CVD_CVDTX2_TXAN9_Pos)             /* (CVD_CVDTX2) CVDT channel to use for TX Index 9 Mask */
#define CVD_CVDTX2_TXAN9(value)               (CVD_CVDTX2_TXAN9_Msk & (_UINT32_(value) << CVD_CVDTX2_TXAN9_Pos)) /* Assignment of value for TXAN9 in the CVD_CVDTX2 register */
#define CVD_CVDTX2_TXAN10_Pos                 _UINT32_(16)                                         /* (CVD_CVDTX2) CVDT channel to use for TX Index 10 Position */
#define CVD_CVDTX2_TXAN10_Msk                 (_UINT32_(0x3F) << CVD_CVDTX2_TXAN10_Pos)            /* (CVD_CVDTX2) CVDT channel to use for TX Index 10 Mask */
#define CVD_CVDTX2_TXAN10(value)              (CVD_CVDTX2_TXAN10_Msk & (_UINT32_(value) << CVD_CVDTX2_TXAN10_Pos)) /* Assignment of value for TXAN10 in the CVD_CVDTX2 register */
#define CVD_CVDTX2_TXAN11_Pos                 _UINT32_(24)                                         /* (CVD_CVDTX2) CVDT channel to use for TX Index 11 Position */
#define CVD_CVDTX2_TXAN11_Msk                 (_UINT32_(0x3F) << CVD_CVDTX2_TXAN11_Pos)            /* (CVD_CVDTX2) CVDT channel to use for TX Index 11 Mask */
#define CVD_CVDTX2_TXAN11(value)              (CVD_CVDTX2_TXAN11_Msk & (_UINT32_(value) << CVD_CVDTX2_TXAN11_Pos)) /* Assignment of value for TXAN11 in the CVD_CVDTX2 register */
#define CVD_CVDTX2_Msk                        _UINT32_(0x3F3F3F3F)                                 /* (CVD_CVDTX2) Register Mask  */


/* -------- CVD_CVDTX3 : (CVD Offset: 0xCC) (R/W 32) CVD TRANSMIT INDEX 12-15 NCONFIGURATION -------- */
#define CVD_CVDTX3_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDTX3) CVD TRANSMIT INDEX 12-15 NCONFIGURATION  Reset Value */

#define CVD_CVDTX3_TXAN12_Pos                 _UINT32_(0)                                          /* (CVD_CVDTX3) CVDT channel to use for TX Index 12 Position */
#define CVD_CVDTX3_TXAN12_Msk                 (_UINT32_(0x3F) << CVD_CVDTX3_TXAN12_Pos)            /* (CVD_CVDTX3) CVDT channel to use for TX Index 12 Mask */
#define CVD_CVDTX3_TXAN12(value)              (CVD_CVDTX3_TXAN12_Msk & (_UINT32_(value) << CVD_CVDTX3_TXAN12_Pos)) /* Assignment of value for TXAN12 in the CVD_CVDTX3 register */
#define CVD_CVDTX3_TXAN13_Pos                 _UINT32_(8)                                          /* (CVD_CVDTX3) CVDT channel to use for TX Index 13 Position */
#define CVD_CVDTX3_TXAN13_Msk                 (_UINT32_(0x3F) << CVD_CVDTX3_TXAN13_Pos)            /* (CVD_CVDTX3) CVDT channel to use for TX Index 13 Mask */
#define CVD_CVDTX3_TXAN13(value)              (CVD_CVDTX3_TXAN13_Msk & (_UINT32_(value) << CVD_CVDTX3_TXAN13_Pos)) /* Assignment of value for TXAN13 in the CVD_CVDTX3 register */
#define CVD_CVDTX3_TXAN14_Pos                 _UINT32_(16)                                         /* (CVD_CVDTX3) CVDT channel to use for TX Index 14 Position */
#define CVD_CVDTX3_TXAN14_Msk                 (_UINT32_(0x3F) << CVD_CVDTX3_TXAN14_Pos)            /* (CVD_CVDTX3) CVDT channel to use for TX Index 14 Mask */
#define CVD_CVDTX3_TXAN14(value)              (CVD_CVDTX3_TXAN14_Msk & (_UINT32_(value) << CVD_CVDTX3_TXAN14_Pos)) /* Assignment of value for TXAN14 in the CVD_CVDTX3 register */
#define CVD_CVDTX3_TXAN15_Pos                 _UINT32_(24)                                         /* (CVD_CVDTX3) CVDT channel to use for TX Index 15 Position */
#define CVD_CVDTX3_TXAN15_Msk                 (_UINT32_(0x3F) << CVD_CVDTX3_TXAN15_Pos)            /* (CVD_CVDTX3) CVDT channel to use for TX Index 15 Mask */
#define CVD_CVDTX3_TXAN15(value)              (CVD_CVDTX3_TXAN15_Msk & (_UINT32_(value) << CVD_CVDTX3_TXAN15_Pos)) /* Assignment of value for TXAN15 in the CVD_CVDTX3 register */
#define CVD_CVDTX3_Msk                        _UINT32_(0x3F3F3F3F)                                 /* (CVD_CVDTX3) Register Mask  */


/* -------- CVD_CVDTX4 : (CVD Offset: 0xD0) (R/W 32) CVD TRANSMIT INDEX 12-15 NCONFIGURATION -------- */
#define CVD_CVDTX4_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDTX4) CVD TRANSMIT INDEX 12-15 NCONFIGURATION  Reset Value */

