Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/cvd.h
#define CVD_CVDSD2C3_SDCHGTIME_Pos            _UINT32_(0)                                          /* (CVD_CVDSD2C3) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s) Position */
#define CVD_CVDSD2C3_SDCHGTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2C3_SDCHGTIME_Pos)       /* (CVD_CVDSD2C3) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s) Mask */
#define CVD_CVDSD2C3_SDCHGTIME(value)         (CVD_CVDSD2C3_SDCHGTIME_Msk & (_UINT32_(value) << CVD_CVDSD2C3_SDCHGTIME_Pos)) /* Assignment of value for SDCHGTIME in the CVD_CVDSD2C3 register */
#define CVD_CVDSD2C3_SDACQTIME_Pos            _UINT32_(8)                                          /* (CVD_CVDSD2C3) Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle Position */
#define CVD_CVDSD2C3_SDACQTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2C3_SDACQTIME_Pos)       /* (CVD_CVDSD2C3) Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle Mask */
#define CVD_CVDSD2C3_SDACQTIME(value)         (CVD_CVDSD2C3_SDACQTIME_Msk & (_UINT32_(value) << CVD_CVDSD2C3_SDACQTIME_Pos)) /* Assignment of value for SDACQTIME in the CVD_CVDSD2C3 register */
#define CVD_CVDSD2C3_CVDCPL_Pos               _UINT32_(16)                                         /* (CVD_CVDSD2C3) Capacitor Voltage Divider (CVD) Setting bits Position */
#define CVD_CVDSD2C3_CVDCPL_Msk               (_UINT32_(0x7) << CVD_CVDSD2C3_CVDCPL_Pos)           /* (CVD_CVDSD2C3) Capacitor Voltage Divider (CVD) Setting bits Mask */
#define CVD_CVDSD2C3_CVDCPL(value)            (CVD_CVDSD2C3_CVDCPL_Msk & (_UINT32_(value) << CVD_CVDSD2C3_CVDCPL_Pos)) /* Assignment of value for CVDCPL in the CVD_CVDSD2C3 register */
#define CVD_CVDSD2C3_CVDEN_Pos                _UINT32_(19)                                         /* (CVD_CVDSD2C3)  Capacitive Voltage Division Enable bit Position */
#define CVD_CVDSD2C3_CVDEN_Msk                (_UINT32_(0x1) << CVD_CVDSD2C3_CVDEN_Pos)            /* (CVD_CVDSD2C3)  Capacitive Voltage Division Enable bit Mask */
#define CVD_CVDSD2C3_CVDEN(value)             (CVD_CVDSD2C3_CVDEN_Msk & (_UINT32_(value) << CVD_CVDSD2C3_CVDEN_Pos)) /* Assignment of value for CVDEN in the CVD_CVDSD2C3 register */
#define CVD_CVDSD2C3_SDMUT_Pos                _UINT32_(24)                                         /* (CVD_CVDSD2C3) Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements Position */
#define CVD_CVDSD2C3_SDMUT_Msk                (_UINT32_(0x1) << CVD_CVDSD2C3_SDMUT_Pos)            /* (CVD_CVDSD2C3) Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements Mask */
#define CVD_CVDSD2C3_SDMUT(value)             (CVD_CVDSD2C3_SDMUT_Msk & (_UINT32_(value) << CVD_CVDSD2C3_SDMUT_Pos)) /* Assignment of value for SDMUT in the CVD_CVDSD2C3 register */
#define CVD_CVDSD2C3_SDSELF_Pos               _UINT32_(25)                                         /* (CVD_CVDSD2C3) Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements Position */
#define CVD_CVDSD2C3_SDSELF_Msk               (_UINT32_(0x1) << CVD_CVDSD2C3_SDSELF_Pos)           /* (CVD_CVDSD2C3) Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements Mask */
#define CVD_CVDSD2C3_SDSELF(value)            (CVD_CVDSD2C3_SDSELF_Msk & (_UINT32_(value) << CVD_CVDSD2C3_SDSELF_Pos)) /* Assignment of value for SDSELF in the CVD_CVDSD2C3 register */
#define CVD_CVDSD2C3_SDINTEN_Pos              _UINT32_(26)                                         /* (CVD_CVDSD2C3) Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt Position */
#define CVD_CVDSD2C3_SDINTEN_Msk              (_UINT32_(0x1) << CVD_CVDSD2C3_SDINTEN_Pos)          /* (CVD_CVDSD2C3) Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt Mask */
#define CVD_CVDSD2C3_SDINTEN(value)           (CVD_CVDSD2C3_SDINTEN_Msk & (_UINT32_(value) << CVD_CVDSD2C3_SDINTEN_Pos)) /* Assignment of value for SDINTEN in the CVD_CVDSD2C3 register */
#define CVD_CVDSD2C3_SDBUF_Pos                _UINT32_(27)                                         /* (CVD_CVDSD2C3) Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist) Position */
#define CVD_CVDSD2C3_SDBUF_Msk                (_UINT32_(0x1) << CVD_CVDSD2C3_SDBUF_Pos)            /* (CVD_CVDSD2C3) Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist) Mask */
#define CVD_CVDSD2C3_SDBUF(value)             (CVD_CVDSD2C3_SDBUF_Msk & (_UINT32_(value) << CVD_CVDSD2C3_SDBUF_Pos)) /* Assignment of value for SDBUF in the CVD_CVDSD2C3 register */
#define CVD_CVDSD2C3_SDEN_Pos                 _UINT32_(30)                                         /* (CVD_CVDSD2C3) Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors. Position */
#define CVD_CVDSD2C3_SDEN_Msk                 (_UINT32_(0x3) << CVD_CVDSD2C3_SDEN_Pos)             /* (CVD_CVDSD2C3) Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors. Mask */
#define CVD_CVDSD2C3_SDEN(value)              (CVD_CVDSD2C3_SDEN_Msk & (_UINT32_(value) << CVD_CVDSD2C3_SDEN_Pos)) /* Assignment of value for SDEN in the CVD_CVDSD2C3 register */
#define CVD_CVDSD2C3_Msk                      _UINT32_(0xCF0F7F7F)                                 /* (CVD_CVDSD2C3) Register Mask  */


/* -------- CVD_CVDSD2T2 : (CVD Offset: 0x12C) (R/W 32) CVD SCAN DESCRIPTOR N TIME2 REGISTER -------- */
#define CVD_CVDSD2T2_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD2T2) CVD SCAN DESCRIPTOR N TIME2 REGISTER  Reset Value */

#define CVD_CVDSD2T2_SDCONTIME_Pos            _UINT32_(0)                                          /* (CVD_CVDSD2T2) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires. Position */
#define CVD_CVDSD2T2_SDCONTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2T2_SDCONTIME_Pos)       /* (CVD_CVDSD2T2) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires. Mask */
#define CVD_CVDSD2T2_SDCONTIME(value)         (CVD_CVDSD2T2_SDCONTIME_Msk & (_UINT32_(value) << CVD_CVDSD2T2_SDCONTIME_Pos)) /* Assignment of value for SDCONTIME in the CVD_CVDSD2T2 register */
#define CVD_CVDSD2T2_SDPOLTIME_Pos            _UINT32_(8)                                          /* (CVD_CVDSD2T2) Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair Position */
#define CVD_CVDSD2T2_SDPOLTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2T2_SDPOLTIME_Pos)       /* (CVD_CVDSD2T2) Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair Mask */
#define CVD_CVDSD2T2_SDPOLTIME(value)         (CVD_CVDSD2T2_SDPOLTIME_Msk & (_UINT32_(value) << CVD_CVDSD2T2_SDPOLTIME_Pos)) /* Assignment of value for SDPOLTIME in the CVD_CVDSD2T2 register */
#define CVD_CVDSD2T2_SDOVRTIME_Pos            _UINT32_(16)                                         /* (CVD_CVDSD2T2) Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair. Position */
#define CVD_CVDSD2T2_SDOVRTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2T2_SDOVRTIME_Pos)       /* (CVD_CVDSD2T2) Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair. Mask */
#define CVD_CVDSD2T2_SDOVRTIME(value)         (CVD_CVDSD2T2_SDOVRTIME_Msk & (_UINT32_(value) << CVD_CVDSD2T2_SDOVRTIME_Pos)) /* Assignment of value for SDOVRTIME in the CVD_CVDSD2T2 register */
#define CVD_CVDSD2T2_SDCHNTIME_Pos            _UINT32_(24)                                         /* (CVD_CVDSD2T2) Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair Position */
#define CVD_CVDSD2T2_SDCHNTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD2T2_SDCHNTIME_Pos)       /* (CVD_CVDSD2T2) Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair Mask */
#define CVD_CVDSD2T2_SDCHNTIME(value)         (CVD_CVDSD2T2_SDCHNTIME_Msk & (_UINT32_(value) << CVD_CVDSD2T2_SDCHNTIME_Pos)) /* Assignment of value for SDCHNTIME in the CVD_CVDSD2T2 register */
#define CVD_CVDSD2T2_Msk                      _UINT32_(0x7F7F7F7F)                                 /* (CVD_CVDSD2T2) Register Mask  */


/* -------- CVD_CVDSD3C1 : (CVD Offset: 0x130) (R/W 32) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER -------- */
#define CVD_CVDSD3C1_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD3C1) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER  Reset Value */

